# https://www.acmicpc.net/problem/10844
# DP

# 1 2 3 4 5 6 7 8 9
#
# 12 10 || 23 21 || 34 32 || 45 43 || 56 54 || 67 65 || 78 76 || 89 87 || 98
#
# 123 121 || 234 232 212 210 || 345 343 323 321 || 456 454 434 432 || 567 565 545 543 || 678 676 656 654
#         || 789 787 767 765 || 898 878 876     || 987 989
# 1234 1232 1212 1210 || 2345 2343 2323 2321 2
# 앞자리가 0 이면 1만 올 수 있다 / 앞자리가 9이면 8만 올 수 있다 / 앞자리가 1~8이면 +- 1 올 수 있다

MOD = 1000000000
N = int(input())
D = [[0] * 10 for _ in range(N)]
for i in range(1, 10):
    D[0][i] = 1

for i in range(1, N):
    for j in range(10):
        if j % 10 == 0:
            D[i][j] = D[i - 1][1] % MOD
        elif j % 10 == 9:
            D[i][j] = D[i - 1][8] % MOD
        else:
            D[i][j] = (D[i - 1][j - 1] + D[i - 1][j + 1]) % MOD

print(sum(D[N - 1]))
